BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446tim1and8.c
/******************************************************************************
	STM32 446 TIM 1 and 8
Author: Sergio Santos 
	<sergio.salazar.santos@gmail.com>
License: GNU General Public License
Hardware: STM32-446
Date: 2262023
Comment:
	
*******************************************************************************/
/*** File Library ***/
#include "stm32446tim1and8.h"

/*** File Procedure & Function Header ***/
/*** TIM Auxiliar ***/
STM32446TIM1_CR1 stm32446_tim1_cr1_inic(void);
STM32446TIM1_CR2 stm32446_tim1_cr2_inic(void);
STM32446TIM1_SMCR stm32446_tim1_smcr_inic(void);
STM32446TIM1_DIER stm32446_tim1_dier_inic(void);
STM32446TIM1_SR stm32446_tim1_sr_inic(void);
STM32446TIM1_EGR stm32446_tim1_egr_inic(void);
STM32446TIM1_CCMR1 stm32446_tim1_ccmr1_inic(void);
STM32446TIM1_CCMR2 stm32446_tim1_ccmr2_inic(void);
STM32446TIM1_CCER stm32446_tim1_ccer_inic(void);
STM32446TIM1_BDTR stm32446_tim1_bdtr_inic(void);
STM32446TIM1_DCR stm32446_tim1_dcr_inic(void);
STM32446TIM8_CR1 stm32446_tim8_cr1_inic(void);
STM32446TIM8_CR2 stm32446_tim8_cr2_inic(void);
STM32446TIM8_SMCR stm32446_tim8_smcr_inic(void);
STM32446TIM8_DIER stm32446_tim8_dier_inic(void);
STM32446TIM8_SR stm32446_tim8_sr_inic(void);
STM32446TIM8_EGR stm32446_tim8_egr_inic(void);
STM32446TIM8_CCMR1 stm32446_tim8_ccmr1_inic(void);
STM32446TIM8_CCMR2 stm32446_tim8_ccmr2_inic(void);
STM32446TIM8_CCER stm32446_tim8_ccer_inic(void);
STM32446TIM8_BDTR stm32446_tim8_bdtr_inic(void);
STM32446TIM8_DCR stm32446_tim8_dcr_inic(void);
/*** TIMER Procedure & Function Definition ***/
/************/
/*** TIM1 ***/
/************/
void STM32446Tim1Clock(uint8_t bool)
{
	if(bool){
		RCC->APB2ENR |= (1 << 0); // timer 1 clock enabled
	}else{
		RCC->APB2ENR &= ~(1 << 0); //timer 1 clock disabled
	}
}
void STM32446Tim1Nvic(uint8_t value)
{ // 24, 25, 26, 27
	switch(value){
		case 0b1000:
			setbit(NVIC->ISER, 1, 24, 1);
		break;
		case 0b0100:
			setbit(NVIC->ISER, 1, 25, 1);
		break;
		case 0b0010:
			setbit(NVIC->ISER, 1, 26, 1);
		break;
		case 0b0001:
			setbit(NVIC->ISER, 1, 27, 1);
		break;
		case 0b11000:
			setbit(NVIC->ICER, 1, 24, 1);
		break;
		case 0b10100:
			setbit(NVIC->ICER, 1, 25, 1);
		break;
		case 0b10010:
			setbit(NVIC->ICER, 1, 26, 1);
		break;
		case 0b10001:
			setbit(NVIC->ICER, 1, 27, 1);
		break;
	default:
	break;
	}
}
/************************/
/*** TIM1 Bit Mapping ***/
/************************/
// CR1
void STM32446Tim1_ckd(uint8_t value)
{
	setreg(&TIM1->CR1, 1, 8, value);
}
uint8_t STM32446Tim1_get_ckd(void)
{
	return readreg(TIM1->CR1, 2, 8);
}
void STM32446Tim1_set_apre(uint8_t bool)
{
	setreg(&TIM1->CR1, 1, 7, bool);
}
void STM32446Tim1_set_cms(uint8_t value)
{
	setreg(&TIM1->CR1, 2, 5, value);
}
void STM32446Tim1_set_dir(uint8_t bool)
{
	setreg(&TIM1->CR1, 1, 4, bool);
}
void STM32446Tim1_set_opm(uint8_t bool)
{
	setreg(&TIM1->CR1, 1, 3, bool);
}
void STM32446Tim1_set_urs(uint8_t bool)
{
	setreg(&TIM1->CR1, 1, 2, bool);
}
void STM32446Tim1_set_udis(uint8_t bool)
{
	setreg(&TIM1->CR1, 1, 1, bool);
}
void STM32446Tim1_cen(uint8_t bool)
{
	setreg(&TIM1->CR1, 1, 0, bool);
}
// CR2
void STM32446Tim1_ois4(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 14, bool);
}
void STM32446Tim1_ois3n(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 13, bool);
}
void STM32446Tim1_ois3(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 12, bool);
}
void STM32446Tim1_ois2n(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 11, bool);
}
void STM32446Tim1_ois2(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 10, bool);
}
void STM32446Tim1_ois1n(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 9, bool);
}
void STM32446Tim1_ois1(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 8, bool);
}
void STM32446Tim1_ti1s(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 7, bool);
}
void STM32446Tim1_mms(uint8_t value)
{
	setreg(&TIM1->CR2, 3, 4, value);
}
void STM32446Tim1_ccds(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 3, bool);
}
void STM32446Tim1_ccus(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 2, bool);
}
void STM32446Tim1_ccpc(uint8_t bool)
{
	setreg(&TIM1->CR2, 1, 0, bool);
}
// SMCR
void STM32446Tim1_etp(uint8_t bool)
{
	setreg(&TIM1->SMCR, 1, 15, bool);
}
void STM32446Tim1_ece(uint8_t bool)
{
	setreg(&TIM1->SMCR, 1, 14, bool);
}
void STM32446Tim1_etps(uint8_t value)
{
	setreg(&TIM1->SMCR, 2, 12, value);
}
void STM32446Tim1_etf(uint8_t value)
{
	setreg(&TIM1->SMCR, 4, 8, value);
}
void STM32446Tim1_msm(uint8_t bool)
{
	setreg(&TIM1->SMCR, 1, 7, bool);
}
void STM32446Tim1_ts(uint8_t value)
{
	setreg(&TIM1->SMCR, 3, 4, value);
}
void STM32446Tim1_sms(uint8_t value)
{
	setreg(&TIM1->SMCR, 3, 0, value);
}
// DIER
void STM32446Tim1_tde(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 14, bool);
}
void STM32446Tim1_comde(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 14, bool);
}
void STM32446Tim1_cc4de(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 12, bool);
}
void STM32446Tim1_cc3de(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 11, bool);
}
void STM32446Tim1_cc2de(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 10, bool);
}
void STM32446Tim1_cc1de(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 9, bool);
}
void STM32446Tim1_ude(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 8, bool);
}
void STM32446Tim1_bie(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 7, bool);
}
void STM32446Tim1_tie(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 6, bool);
}
void STM32446Tim1_comie(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 5, bool);
}
void STM32446Tim1_cc4ie(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 4, bool);
}
void STM32446Tim1_cc3ie(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 3, bool);
}
void STM32446Tim1_cc2ie(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 2, bool);
}
void STM32446Tim1_cc1ie(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 1, bool);
}
void STM32446Tim1_uie(uint8_t bool)
{
	setreg(&TIM1->DIER, 1, 0, bool);
}
// SR
uint8_t STM32446Tim1_cc4of(void)
{
	return readreg(TIM1->SR, 1, 12);
}
void STM32446Tim1_clear_cc4of(void)
{
	setreg(&TIM1->SR, 1, 12, 0);
}
uint8_t STM32446Tim1_cc3of(void)
{
	return readreg(TIM1->SR, 1, 11);
}
void STM32446Tim1_clear_cc3of(void)
{
	setreg(&TIM1->SR, 1, 11, 0);
}
uint8_t STM32446Tim1_cc2of(void)
{
	return readreg(TIM1->SR, 1, 10);
}
void STM32446Tim1_clear_cc2of(void)
{
	setreg(&TIM1->SR, 1, 10, 0);
}
uint8_t STM32446Tim1_cc1of(void)
{
	return readreg(TIM1->SR, 1, 9);
}
void STM32446Tim1_clear_cc1of(void)
{
	setreg(&TIM1->SR, 1, 9, 0);
}
uint8_t STM32446Tim1_bif(void)
{
	return readreg(TIM1->SR, 1, 7);
}
void STM32446Tim1_clear_bif(void)
{
	setreg(&TIM1->SR, 1, 7, 0);
}
uint8_t STM32446Tim1_tif(void)
{
	return readreg(TIM1->SR, 1, 6);
}
void STM32446Tim1_clear_tif(void)
{
	setreg(&TIM1->SR, 1, 6, 0);
}
uint8_t STM32446Tim1_comif(void)
{
	return readreg(TIM1->SR, 1, 5);
}
void STM32446Tim1_clear_comif(void)
{
	setreg(&TIM1->SR, 1, 5, 0);
}
uint8_t STM32446Tim1_cc4if(void)
{
	return readreg(TIM1->SR, 1, 4);
}
void STM32446Tim1_clear_cc4if(void)
{
	setreg(&TIM1->SR, 1, 4, 0);
}
uint8_t STM32446Tim1_cc3if(void)
{
	return readreg(TIM1->SR, 1, 3);
}
void STM32446Tim1_clear_cc3if(void)
{
	setreg(&TIM1->SR, 1, 3, 0);
}
uint8_t STM32446Tim1_cc2if(void)
{
	return readreg(TIM1->SR, 1, 2);
}
void STM32446Tim1_clear_cc2if(void)
{
	setreg(&TIM1->SR, 1, 2, 0);
}
uint8_t STM32446Tim1_cc1if(void)
{
	return readreg(TIM1->SR, 1, 1);
}
void STM32446Tim1_clear_cc1if(void)
{
	setreg(&TIM1->SR, 1, 1, 0);
}
uint8_t STM32446Tim1_uif(void)
{
	return readreg(TIM1->SR, 1, 0);
}
void STM32446Tim1_clear_uif(void)
{
	setreg(&TIM1->SR, 1, 0, 0);
}
// EGR
void STM32446Tim1_bg(void)
{
	setreg(&TIM1->EGR, 1, 7, 1);
}
void STM32446Tim1_tg(void)
{
	setreg(&TIM1->EGR, 1, 6, 1);
}
void STM32446Tim1_comg(void)
{
	setreg(&TIM1->EGR, 1, 5, 1);
}
void STM32446Tim1_cc4g(void)
{
	setreg(&TIM1->EGR, 1, 4, 1);
}
void STM32446Tim1_cc3g(void)
{
	setreg(&TIM1->EGR, 1, 3, 1);
}
void STM32446Tim1_cc2g(void)
{
	setreg(&TIM1->EGR, 1, 2, 1);
}
void STM32446Tim1_cc1g(void)
{
	setreg(&TIM1->EGR, 1, 1, 1);
}
void STM32446Tim1_ug(void)
{
	setreg(&TIM1->EGR, 1, 0, 1);
}
// CCMR1
void STM32446Tim1_oc2ce(uint8_t value)
{
	setreg(&TIM1->CCMR1, 1, 15, value);
}
void STM32446Tim1_oc2m(uint8_t value)
{
	setreg(&TIM1->CCMR1, 3, 12, value);
}
void STM32446Tim1_ic2f(uint8_t value)
{
	setreg(&TIM1->CCMR1, 4, 12, value);
}
void STM32446Tim1_oc2pe(uint8_t bool)
{
	setreg(&TIM1->CCMR1, 1, 11, bool);
}
void STM32446Tim1_oc2fe(uint8_t bool)
{
	setreg(&TIM1->CCMR1, 1, 10, bool);
}
void STM32446Tim1_ic2psc(uint8_t value)
{
	setreg(&TIM1->CCMR1, 2, 10, value);
}
void STM32446Tim1_cc2s(uint8_t value)
{
	setreg(&TIM1->CCMR1, 2, 8, value);
}
void STM32446Tim1_oc1ce(uint8_t value)
{
	setreg(&TIM1->CCMR1, 1, 7, value);
}
void STM32446Tim1_oc1m(uint8_t value)
{
	setreg(&TIM1->CCMR1, 3, 4, value);
}
void STM32446Tim1_ic1f(uint8_t value)
{
	setreg(&TIM1->CCMR1, 4, 4, value);
}
void STM32446Tim1_oc1pe(uint8_t bool)
{
	setreg(&TIM1->CCMR1, 1, 3, bool);
}
void STM32446Tim1_oc1fe(uint8_t bool)
{
	setreg(&TIM1->CCMR1, 1, 2, bool);
}
void STM32446Tim1_ic1psc(uint8_t value)
{
	setreg(&TIM1->CCMR1, 2, 2, value);
}
void STM32446Tim1_cc1s(uint8_t value)
{
	setreg(&TIM1->CCMR1, 2, 0, value);
}
// CCMR2
void STM32446Tim1_oc4ce(uint8_t value)
{
	setreg(&TIM1->CCMR2, 1, 15, value);
}
void STM32446Tim1_oc4m(uint8_t value)
{
	setreg(&TIM1->CCMR2, 3, 12, value);
}
void STM32446Tim1_ic4f(uint8_t value)
{
	setreg(&TIM1->CCMR2, 4, 12, value);
}
void STM32446Tim1_oc4pe(uint8_t bool)
{
	setreg(&TIM1->CCMR2, 1, 11, bool);
}
void STM32446Tim1_oc4fe(uint8_t bool)
{
	setreg(&TIM1->CCMR2, 1, 10, bool);
}
void STM32446Tim1_ic4psc(uint8_t value)
{
	setreg(&TIM1->CCMR2, 2, 10, value);
}
void STM32446Tim1_cc4s(uint8_t value)
{
	setreg(&TIM1->CCMR2, 2, 8, value);
}
void STM32446Tim1_oc3ce(uint8_t value)
{
	setreg(&TIM1->CCMR2, 1, 7, value);
}
void STM32446Tim1_oc3m(uint8_t value)
{
	setreg(&TIM1->CCMR2, 3, 4, value);
}
void STM32446Tim1_ic3f(uint8_t value)
{
	setreg(&TIM1->CCMR2, 4, 4, value);
}
void STM32446Tim1_oc3pe(uint8_t bool)
{
	setreg(&TIM1->CCMR2, 1, 3, bool);
}
void STM32446Tim1_oc3fe(uint8_t bool)
{
	setreg(&TIM1->CCMR2, 1, 2, bool);
}
void STM32446Tim1_ic3psc(uint8_t value)
{
	setreg(&TIM1->CCMR2, 2, 2, value);
}
void STM32446Tim1_cc3s(uint8_t value)
{
	setreg(&TIM1->CCMR2, 2, 0, value);
}
// CCER
void STM32446Tim1_cc4np(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 15, bool);
}
void STM32446Tim1_cc4p(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 13, bool);
}
void STM32446Tim1_cc4e(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 12, bool);
}
void STM32446Tim1_cc3np(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 11, bool);
}
void STM32446Tim1_cc3ne(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 11, bool);
}
void STM32446Tim1_cc3p(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 9, bool);
}
void STM32446Tim1_cc3e(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 8, bool);
}
void STM32446Tim1_cc2np(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 7, bool);
}
void STM32446Tim1_cc2ne(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 6, bool);
}
void STM32446Tim1_cc2p(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 5, bool);
}
void STM32446Tim1_cc2e(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 4, bool);
}
void STM32446Tim1_cc1np(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 3, bool);
}
void STM32446Tim1_cc1ne(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 2, bool);
}
void STM32446Tim1_cc1p(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 1, bool);
}
void STM32446Tim1_cc1e(uint8_t bool)
{
	setreg(&TIM1->CCER, 1, 0, bool);
}
// CNT
void STM32446Tim1_cnt(uint16_t value)
{
	TIM1->CNT = value;
}
uint16_t STM32446Tim1_get_cnt(void)
{
	return TIM1->CNT;
}
// PSC
void STM32446Tim1_psc(uint16_t value)
{
	TIM1->PSC = value;
}
// ARR
void STM32446Tim1_arr(uint16_t value)
{
	TIM1->ARR = value;
}
// RCR
void STM32446Tim1_rcr(uint8_t value)
{
	TIM1->RCR = value;
}
// CCR1
void STM32446Tim1_ccr1(uint16_t value)
{
	TIM1->CCR1 = value;
}
// CCR2
void STM32446Tim1_ccr2(uint16_t value)
{
	TIM1->CCR2 = value;
}
// CCR3
void STM32446Tim1_ccr3(uint16_t value)
{
	TIM1->CCR3 = value;
}
// CCR4
void STM32446Tim1_ccr4(uint16_t value)
{
	TIM1->CCR4 = value;
}
// BDTR
void STM32446Tim1_moe(uint8_t bool)
{
	setreg(&TIM1->BDTR, 1, 15, bool);
}
void STM32446Tim1_aoe(uint8_t bool)
{
	setreg(&TIM1->BDTR, 1, 14, bool);
}
void STM32446Tim1_bkp(uint8_t bool)
{
	setreg(&TIM1->BDTR, 1, 13, bool);
}
void STM32446Tim1_bke(uint8_t bool)
{
	setreg(&TIM1->BDTR, 1, 12, bool);
}
void STM32446Tim1_ossr(uint8_t bool)
{
	setreg(&TIM1->BDTR, 1, 11, bool);
}
void STM32446Tim1_ossi(uint8_t bool)
{
	setreg(&TIM1->BDTR, 1, 10, bool);
}
void STM32446Tim1_lock(uint8_t value)
{
	setreg(&TIM1->BDTR, 2, 8, value);
}
void STM32446Tim1_dtg(uint8_t value)
{
	setreg(&TIM1->BDTR, 8, 0, value);
}
// DCR
void STM32446Tim1_dbl(uint8_t value)
{
	setreg(&TIM1->DCR, 5, 8, value);
}
void STM32446Tim1_dba(uint8_t value)
{
	setreg(&TIM1->DCR, 5, 0, value);
}
// DMAR
void STM32446Tim1_dmab(uint16_t value)
{
	TIM1->DMAR = value;
}
uint16_t STM32446Tim1_get_dmab(void)
{
	return TIM1->DMAR;
}
/************/
/*** TIM8 ***/
/************/
void STM32446Tim8Clock(uint8_t bool)
{
	if(bool){
		RCC->APB2ENR |= (1 << 1); // timer 8 clock enabled
	}else{
		RCC->APB2ENR &= ~(1 << 1); //timer 8 clock disabled
	}
}
void STM32446Tim8Nvic(uint8_t value)
{ // 43, 44, 45, 46
	switch(value){
		case 0b1000:
			setbit(NVIC->ISER, 1, 43, 1);
		break;
		case 0b0100:
			setbit(NVIC->ISER, 1, 44, 1);
		break;
		case 0b0010:
			setbit(NVIC->ISER, 1, 45, 1);
		break;
		case 0b0001:
			setbit(NVIC->ISER, 1, 46, 1);
		break;
		case 0b11000:
			setbit(NVIC->ICER, 1, 43, 1);
		break;
		case 0b10100:
			setbit(NVIC->ICER, 1, 44, 1);
		break;
		case 0b10010:
			setbit(NVIC->ICER, 1, 45, 1);
		break;
		case 0b10001:
			setbit(NVIC->ICER, 1, 46, 1);
		break;
	default:
	break;
	}
}
/************************/
/*** TIM8 Bit Mapping ***/
/************************/
// CR1
void STM32446Tim8_ckd(uint8_t value)
{
	setreg(&TIM8->CR1, 1, 8, value);
}
uint8_t STM32446Tim8_get_ckd(void)
{
	return readreg(TIM8->CR1, 2, 8);
}
void STM32446Tim8_set_apre(uint8_t bool)
{
	setreg(&TIM8->CR1, 1, 7, bool);
}
void STM32446Tim8_set_cms(uint8_t value)
{
	setreg(&TIM8->CR1, 2, 5, value);
}
void STM32446Tim8_set_dir(uint8_t bool)
{
	setreg(&TIM8->CR1, 1, 4, bool);
}
void STM32446Tim8_set_opm(uint8_t bool)
{
	setreg(&TIM8->CR1, 1, 3, bool);
}
void STM32446Tim8_set_urs(uint8_t bool)
{
	setreg(&TIM8->CR1, 1, 2, bool);
}
void STM32446Tim8_set_udis(uint8_t bool)
{
	setreg(&TIM8->CR1, 1, 1, bool);
}
void STM32446Tim8_cen(uint8_t bool)
{
	setreg(&TIM8->CR1, 1, 0, bool);
}
// CR2
void STM32446Tim8_ois4(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 14, bool);
}
void STM32446Tim8_ois3n(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 13, bool);
}
void STM32446Tim8_ois3(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 12, bool);
}
void STM32446Tim8_ois2n(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 11, bool);
}
void STM32446Tim8_ois2(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 10, bool);
}
void STM32446Tim8_ois1n(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 9, bool);
}
void STM32446Tim8_ois1(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 8, bool);
}
void STM32446Tim8_ti1s(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 7, bool);
}
void STM32446Tim8_mms(uint8_t value)
{
	setreg(&TIM8->CR2, 3, 4, value);
}
void STM32446Tim8_ccds(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 3, bool);
}
void STM32446Tim8_ccus(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 2, bool);
}
void STM32446Tim8_ccpc(uint8_t bool)
{
	setreg(&TIM8->CR2, 1, 0, bool);
}
// SMCR
void STM32446Tim8_etp(uint8_t bool)
{
	setreg(&TIM8->SMCR, 1, 15, bool);
}
void STM32446Tim8_ece(uint8_t bool)
{
	setreg(&TIM8->SMCR, 1, 14, bool);
}
void STM32446Tim8_etps(uint8_t value)
{
	setreg(&TIM8->SMCR, 2, 12, value);
}
void STM32446Tim8_etf(uint8_t value)
{
	setreg(&TIM8->SMCR, 4, 8, value);
}
void STM32446Tim8_msm(uint8_t bool)
{
	setreg(&TIM8->SMCR, 1, 7, bool);
}
void STM32446Tim8_ts(uint8_t value)
{
	setreg(&TIM8->SMCR, 3, 4, value);
}
void STM32446Tim8_sms(uint8_t value)
{
	setreg(&TIM8->SMCR, 3, 0, value);
}
// DIER
void STM32446Tim8_tde(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 14, bool);
}
void STM32446Tim8_comde(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 14, bool);
}
void STM32446Tim8_cc4de(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 12, bool);
}
void STM32446Tim8_cc3de(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 11, bool);
}
void STM32446Tim8_cc2de(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 10, bool);
}
void STM32446Tim8_cc1de(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 9, bool);
}
void STM32446Tim8_ude(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 8, bool);
}
void STM32446Tim8_bie(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 7, bool);
}
void STM32446Tim8_tie(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 6, bool);
}
void STM32446Tim8_comie(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 5, bool);
}
void STM32446Tim8_cc4ie(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 4, bool);
}
void STM32446Tim8_cc3ie(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 3, bool);
}
void STM32446Tim8_cc2ie(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 2, bool);
}
void STM32446Tim8_cc1ie(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 1, bool);
}
void STM32446Tim8_uie(uint8_t bool)
{
	setreg(&TIM8->DIER, 1, 0, bool);
}
// SR
uint8_t STM32446Tim8_cc4of(void)
{
	return readreg(TIM8->SR, 1, 12);
}
void STM32446Tim8_clear_cc4of(void)
{
	setreg(&TIM8->SR, 1, 12, 0);
}
uint8_t STM32446Tim8_cc3of(void)
{
	return readreg(TIM8->SR, 1, 11);
}
void STM32446Tim8_clear_cc3of(void)
{
	setreg(&TIM8->SR, 1, 11, 0);
}
uint8_t STM32446Tim8_cc2of(void)
{
	return readreg(TIM8->SR, 1, 10);
}
void STM32446Tim8_clear_cc2of(void)
{
	setreg(&TIM8->SR, 1, 10, 0);
}
uint8_t STM32446Tim8_cc1of(void)
{
	return readreg(TIM8->SR, 1, 9);
}
void STM32446Tim8_clear_cc1of(void)
{
	setreg(&TIM8->SR, 1, 9, 0);
}
uint8_t STM32446Tim8_bif(void)
{
	return readreg(TIM8->SR, 1, 7);
}
void STM32446Tim8_clear_bif(void)
{
	setreg(&TIM8->SR, 1, 7, 0);
}
uint8_t STM32446Tim8_tif(void)
{
	return readreg(TIM8->SR, 1, 6);
}
void STM32446Tim8_clear_tif(void)
{
	setreg(&TIM8->SR, 1, 6, 0);
}
uint8_t STM32446Tim8_comif(void)
{
	return readreg(TIM8->SR, 1, 5);
}
void STM32446Tim8_clear_comif(void)
{
	setreg(&TIM8->SR, 1, 5, 0);
}
uint8_t STM32446Tim8_cc4if(void)
{
	return readreg(TIM8->SR, 1, 4);
}
void STM32446Tim8_clear_cc4if(void)
{
	setreg(&TIM8->SR, 1, 4, 0);
}
uint8_t STM32446Tim8_cc3if(void)
{
	return readreg(TIM8->SR, 1, 3);
}
void STM32446Tim8_clear_cc3if(void)
{
	setreg(&TIM8->SR, 1, 3, 0);
}
uint8_t STM32446Tim8_cc2if(void)
{
	return readreg(TIM8->SR, 1, 2);
}
void STM32446Tim8_clear_cc2if(void)
{
	setreg(&TIM8->SR, 1, 2, 0);
}
uint8_t STM32446Tim8_cc1if(void)
{
	return readreg(TIM8->SR, 1, 1);
}
void STM32446Tim8_clear_cc1if(void)
{
	setreg(&TIM8->SR, 1, 1, 0);
}
uint8_t STM32446Tim8_uif(void)
{
	return readreg(TIM8->SR, 1, 0);
}
void STM32446Tim8_clear_uif(void)
{
	setreg(&TIM8->SR, 1, 0, 0);
}
// EGR
void STM32446Tim8_bg(void)
{
	setreg(&TIM8->EGR, 1, 7, 1);
}
void STM32446Tim8_tg(void)
{
	setreg(&TIM8->EGR, 1, 6, 1);
}
void STM32446Tim8_comg(void)
{
	setreg(&TIM8->EGR, 1, 5, 1);
}
void STM32446Tim8_cc4g(void)
{
	setreg(&TIM8->EGR, 1, 4, 1);
}
void STM32446Tim8_cc3g(void)
{
	setreg(&TIM8->EGR, 1, 3, 1);
}
void STM32446Tim8_cc2g(void)
{
	setreg(&TIM8->EGR, 1, 2, 1);
}
void STM32446Tim8_cc1g(void)
{
	setreg(&TIM8->EGR, 1, 1, 1);
}
void STM32446Tim8_ug(void)
{
	setreg(&TIM8->EGR, 1, 0, 1);
}
// CCMR1
void STM32446Tim8_oc2ce(uint8_t value)
{
	setreg(&TIM8->CCMR1, 1, 15, value);
}
void STM32446Tim8_oc2m(uint8_t value)
{
	setreg(&TIM8->CCMR1, 3, 12, value);
}
void STM32446Tim8_ic2f(uint8_t value)
{
	setreg(&TIM8->CCMR1, 4, 12, value);
}
void STM32446Tim8_oc2pe(uint8_t bool)
{
	setreg(&TIM8->CCMR1, 1, 11, bool);
}
void STM32446Tim8_oc2fe(uint8_t bool)
{
	setreg(&TIM8->CCMR1, 1, 10, bool);
}
void STM32446Tim8_ic2psc(uint8_t value)
{
	setreg(&TIM8->CCMR1, 2, 10, value);
}
void STM32446Tim8_cc2s(uint8_t value)
{
	setreg(&TIM8->CCMR1, 2, 8, value);
}
void STM32446Tim8_oc1ce(uint8_t value)
{
	setreg(&TIM8->CCMR1, 1, 7, value);
}
void STM32446Tim8_oc1m(uint8_t value)
{
	setreg(&TIM8->CCMR1, 3, 4, value);
}
void STM32446Tim8_ic1f(uint8_t value)
{
	setreg(&TIM8->CCMR1, 4, 4, value);
}
void STM32446Tim8_oc1pe(uint8_t bool)
{
	setreg(&TIM8->CCMR1, 1, 3, bool);
}
void STM32446Tim8_oc1fe(uint8_t bool)
{
	setreg(&TIM8->CCMR1, 1, 2, bool);
}
void STM32446Tim8_ic1psc(uint8_t value)
{
	setreg(&TIM8->CCMR1, 2, 2, value);
}
void STM32446Tim8_cc1s(uint8_t value)
{
	setreg(&TIM8->CCMR1, 2, 0, value);
}
// CCMR2
void STM32446Tim8_oc4ce(uint8_t value)
{
	setreg(&TIM8->CCMR2, 1, 15, value);
}
void STM32446Tim8_oc4m(uint8_t value)
{
	setreg(&TIM8->CCMR2, 3, 12, value);
}
void STM32446Tim8_ic4f(uint8_t value)
{
	setreg(&TIM8->CCMR2, 4, 12, value);
}
void STM32446Tim8_oc4pe(uint8_t bool)
{
	setreg(&TIM8->CCMR2, 1, 11, bool);
}
void STM32446Tim8_oc4fe(uint8_t bool)
{
	setreg(&TIM8->CCMR2, 1, 10, bool);
}
void STM32446Tim8_ic4psc(uint8_t value)
{
	setreg(&TIM8->CCMR2, 2, 10, value);
}
void STM32446Tim8_cc4s(uint8_t value)
{
	setreg(&TIM8->CCMR2, 2, 8, value);
}
void STM32446Tim8_oc3ce(uint8_t value)
{
	setreg(&TIM8->CCMR2, 1, 7, value);
}
void STM32446Tim8_oc3m(uint8_t value)
{
	setreg(&TIM8->CCMR2, 3, 4, value);
}
void STM32446Tim8_ic3f(uint8_t value)
{
	setreg(&TIM8->CCMR2, 4, 4, value);
}
void STM32446Tim8_oc3pe(uint8_t bool)
{
	setreg(&TIM8->CCMR2, 1, 3, bool);
}
void STM32446Tim8_oc3fe(uint8_t bool)
{
	setreg(&TIM8->CCMR2, 1, 2, bool);
}
void STM32446Tim8_ic3psc(uint8_t value)
{
	setreg(&TIM8->CCMR2, 2, 2, value);
}
void STM32446Tim8_cc3s(uint8_t value)
{
	setreg(&TIM8->CCMR2, 2, 0, value);
}
// CCER
void STM32446Tim8_cc4np(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 15, bool);
}
void STM32446Tim8_cc4p(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 13, bool);
}
void STM32446Tim8_cc4e(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 12, bool);
}
void STM32446Tim8_cc3np(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 11, bool);
}
void STM32446Tim8_cc3ne(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 11, bool);
}
void STM32446Tim8_cc3p(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 9, bool);
}
void STM32446Tim8_cc3e(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 8, bool);
}
void STM32446Tim8_cc2np(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 7, bool);
}
void STM32446Tim8_cc2ne(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 6, bool);
}
void STM32446Tim8_cc2p(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 5, bool);
}
void STM32446Tim8_cc2e(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 4, bool);
}
void STM32446Tim8_cc1np(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 3, bool);
}
void STM32446Tim8_cc1ne(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 2, bool);
}
void STM32446Tim8_cc1p(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 1, bool);
}
void STM32446Tim8_cc1e(uint8_t bool)
{
	setreg(&TIM8->CCER, 1, 0, bool);
}
// CNT
void STM32446Tim8_cnt(uint16_t value)
{
	TIM8->CNT = value;
}
uint16_t STM32446Tim8_get_cnt(void)
{
	return TIM8->CNT;
}
// PSC
void STM32446Tim8_psc(uint16_t value)
{
	TIM8->PSC = value;
}
// ARR
void STM32446Tim8_arr(uint16_t value)
{
	TIM8->ARR = value;
}
// RCR
void STM32446Tim8_rcr(uint8_t value)
{
	TIM8->RCR = value;
}
// CCR1
void STM32446Tim8_ccr1(uint16_t value)
{
	TIM8->CCR1 = value;
}
// CCR2
void STM32446Tim8_ccr2(uint16_t value)
{
	TIM8->CCR2 = value;
}
// CCR3
void STM32446Tim8_ccr3(uint16_t value)
{
	TIM8->CCR3 = value;
}
// CCR4
void STM32446Tim8_ccr4(uint16_t value)
{
	TIM8->CCR4 = value;
}
// BDTR
void STM32446Tim8_moe(uint8_t bool)
{
	setreg(&TIM8->BDTR, 1, 15, bool);
}
void STM32446Tim8_aoe(uint8_t bool)
{
	setreg(&TIM8->BDTR, 1, 14, bool);
}
void STM32446Tim8_bkp(uint8_t bool)
{
	setreg(&TIM8->BDTR, 1, 13, bool);
}
void STM32446Tim8_bke(uint8_t bool)
{
	setreg(&TIM8->BDTR, 1, 12, bool);
}
void STM32446Tim8_ossr(uint8_t bool)
{
	setreg(&TIM8->BDTR, 1, 11, bool);
}
void STM32446Tim8_ossi(uint8_t bool)
{
	setreg(&TIM8->BDTR, 1, 10, bool);
}
void STM32446Tim8_lock(uint8_t value)
{
	setreg(&TIM8->BDTR, 2, 8, value);
}
void STM32446Tim8_dtg(uint8_t value)
{
	setreg(&TIM8->BDTR, 8, 0, value);
}
// DCR
void STM32446Tim8_dbl(uint8_t value)
{
	setreg(&TIM8->DCR, 5, 8, value);
}
void STM32446Tim8_dba(uint8_t value)
{
	setreg(&TIM8->DCR, 5, 0, value);
}
// DMAR
void STM32446Tim8_dmab(uint16_t value)
{
	TIM8->DMAR = value;
}
uint16_t STM32446Tim8_get_dmab(void)
{
	return TIM8->DMAR;
}
/********************************************/
