BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446tim1and8.c
/*** INIC Procedure & Function Definition ***/
/********************************************/
/*** TIM1 Auxiliar ***/
STM32446TIM1_CR1 stm32446_tim1_cr1_inic(void)
{
	STM32446TIM1_CR1 stm32446_tim1_cr1;
	// CR1
	stm32446_tim1_cr1.ckd = STM32446Tim1_ckd;
	stm32446_tim1_cr1.get_ckd = STM32446Tim1_get_ckd;
	stm32446_tim1_cr1.apre = STM32446Tim1_set_apre;
	stm32446_tim1_cr1.cms = STM32446Tim1_set_cms;
	stm32446_tim1_cr1.dir = STM32446Tim1_set_dir;
	stm32446_tim1_cr1.opm = STM32446Tim1_set_opm;
	stm32446_tim1_cr1.urs = STM32446Tim1_set_urs;
	stm32446_tim1_cr1.udis = STM32446Tim1_set_udis;
	stm32446_tim1_cr1.cen = STM32446Tim1_cen;
	return stm32446_tim1_cr1;
}
STM32446TIM1_CR2 stm32446_tim1_cr2_inic(void)
{
	STM32446TIM1_CR2 stm32446_tim1_cr2;
	// CR2
	stm32446_tim1_cr2.ois4 = STM32446Tim1_ois4;
	stm32446_tim1_cr2.ois3n = STM32446Tim1_ois3n;
	stm32446_tim1_cr2.ois3 = STM32446Tim1_ois3;
	stm32446_tim1_cr2.ois2n = STM32446Tim1_ois2n;
	stm32446_tim1_cr2.ois1 = STM32446Tim1_ois1;
	stm32446_tim1_cr2.ti1s = STM32446Tim1_ti1s;
	stm32446_tim1_cr2.mms = STM32446Tim1_mms;
	stm32446_tim1_cr2.ccds = STM32446Tim1_ccds;
	stm32446_tim1_cr2.ccus = STM32446Tim1_ccus;
	stm32446_tim1_cr2.ccpc = STM32446Tim1_ccpc;
	return stm32446_tim1_cr2;
}
STM32446TIM1_SMCR stm32446_tim1_smcr_inic(void)
{
	STM32446TIM1_SMCR stm32446_tim1_smcr;
	// SMCR
	stm32446_tim1_smcr.etp = STM32446Tim1_etp;
	stm32446_tim1_smcr.ece = STM32446Tim1_ece;
	stm32446_tim1_smcr.etps = STM32446Tim1_etps;
	stm32446_tim1_smcr.etf = STM32446Tim1_etf;
	stm32446_tim1_smcr.msm = STM32446Tim1_msm;
	stm32446_tim1_smcr.ts = STM32446Tim1_ts;
	stm32446_tim1_smcr.sms = STM32446Tim1_sms;
	return stm32446_tim1_smcr;
}
STM32446TIM1_DIER stm32446_tim1_dier_inic(void)
{
	STM32446TIM1_DIER stm32446_tim1_dier;
	// DIER
	stm32446_tim1_dier.tde = STM32446Tim1_tde;
	stm32446_tim1_dier.cc4de = STM32446Tim1_cc4de;
	stm32446_tim1_dier.cc3de = STM32446Tim1_cc3de;
	stm32446_tim1_dier.cc2de = STM32446Tim1_cc2de;
	stm32446_tim1_dier.cc1de = STM32446Tim1_cc1de;
	stm32446_tim1_dier.ude = STM32446Tim1_ude;
	stm32446_tim1_dier.bie = STM32446Tim1_bie;
	stm32446_tim1_dier.tie = STM32446Tim1_tie;
	stm32446_tim1_dier.comie = STM32446Tim1_comie;
	stm32446_tim1_dier.cc4ie = STM32446Tim1_cc4ie;
	stm32446_tim1_dier.cc3ie = STM32446Tim1_cc3ie;
	stm32446_tim1_dier.cc2ie = STM32446Tim1_cc2ie;
	stm32446_tim1_dier.cc1ie = STM32446Tim1_cc1ie;
	stm32446_tim1_dier.uie = STM32446Tim1_uie;
	return stm32446_tim1_dier;
}
STM32446TIM1_SR stm32446_tim1_sr_inic(void)
{
	STM32446TIM1_SR stm32446_tim1_sr;
	// SR
	stm32446_tim1_sr.cc4of = STM32446Tim1_cc4of;
	stm32446_tim1_sr.clear_cc4of = STM32446Tim1_clear_cc4of;
	stm32446_tim1_sr.cc3of = STM32446Tim1_cc3of;
	stm32446_tim1_sr.clear_cc3of = STM32446Tim1_clear_cc3of;
	stm32446_tim1_sr.cc2of = STM32446Tim1_cc2of;
	stm32446_tim1_sr.clear_cc2of = STM32446Tim1_clear_cc2of;
	stm32446_tim1_sr.cc1of = STM32446Tim1_cc1of;
	stm32446_tim1_sr.clear_cc1of = STM32446Tim1_clear_cc1of;
	stm32446_tim1_sr.bif = STM32446Tim1_bif;
	stm32446_tim1_sr.clear_bif = STM32446Tim1_clear_bif;
	stm32446_tim1_sr.tif = STM32446Tim1_tif;
	stm32446_tim1_sr.clear_tif = STM32446Tim1_clear_tif;
	stm32446_tim1_sr.comif = STM32446Tim1_comif;
	stm32446_tim1_sr.clear_comif = STM32446Tim1_clear_comif;
	stm32446_tim1_sr.cc4if = STM32446Tim1_cc4if;
	stm32446_tim1_sr.clear_cc4if = STM32446Tim1_clear_cc4if;
	stm32446_tim1_sr.cc3if = STM32446Tim1_cc3if;
	stm32446_tim1_sr.clear_cc3if = STM32446Tim1_clear_cc3if;
	stm32446_tim1_sr.cc2if = STM32446Tim1_cc2if;
	stm32446_tim1_sr.clear_cc2if = STM32446Tim1_clear_cc2if;
	stm32446_tim1_sr.cc1if = STM32446Tim1_cc1if;
	stm32446_tim1_sr.clear_cc1if = STM32446Tim1_clear_cc1if;
	stm32446_tim1_sr.uif = STM32446Tim1_uif;
	stm32446_tim1_sr.clear_uif = STM32446Tim1_clear_uif;
	return stm32446_tim1_sr;
}
STM32446TIM1_EGR stm32446_tim1_egr_inic(void)
{
	STM32446TIM1_EGR stm32446_tim1_egr;
	// EGR
	stm32446_tim1_egr.tg = STM32446Tim1_tg;
	stm32446_tim1_egr.cc4g = STM32446Tim1_cc4g;
	stm32446_tim1_egr.cc3g = STM32446Tim1_cc3g;
	stm32446_tim1_egr.cc2g = STM32446Tim1_cc2g;
	stm32446_tim1_egr.cc1g = STM32446Tim1_cc1g;
	stm32446_tim1_egr.ug = STM32446Tim1_ug;
	return stm32446_tim1_egr;
}
STM32446TIM1_CCMR1 stm32446_tim1_ccmr1_inic(void)
{
	STM32446TIM1_CCMR1 stm32446_tim1_ccmr1;
	// CCMR1
	stm32446_tim1_ccmr1.oc2ce = STM32446Tim1_oc2ce;
	stm32446_tim1_ccmr1.oc2m = STM32446Tim1_oc2m;
	stm32446_tim1_ccmr1.ic2f = STM32446Tim1_ic2f;
	stm32446_tim1_ccmr1.oc2pe = STM32446Tim1_oc2pe;
	stm32446_tim1_ccmr1.oc2fe = STM32446Tim1_oc2fe;
	stm32446_tim1_ccmr1.ic2psc = STM32446Tim1_ic2psc;
	stm32446_tim1_ccmr1.cc2s = STM32446Tim1_cc2s;
	stm32446_tim1_ccmr1.oc1ce = STM32446Tim1_oc1ce;
	stm32446_tim1_ccmr1.oc1m = STM32446Tim1_oc1m;
	stm32446_tim1_ccmr1.ic1f = STM32446Tim1_ic1f;
	stm32446_tim1_ccmr1.oc1pe = STM32446Tim1_oc1pe;
	stm32446_tim1_ccmr1.oc1fe = STM32446Tim1_oc1fe;
	stm32446_tim1_ccmr1.ic1psc = STM32446Tim1_ic1psc;
	stm32446_tim1_ccmr1.cc1s = STM32446Tim1_cc1s;
	return stm32446_tim1_ccmr1;
}
STM32446TIM1_CCMR2 stm32446_tim1_ccmr2_inic(void)
{
	STM32446TIM1_CCMR2 stm32446_tim1_ccmr2;
	// CCMR2
	stm32446_tim1_ccmr2.oc4ce = STM32446Tim1_oc4ce;
	stm32446_tim1_ccmr2.oc4m = STM32446Tim1_oc4m;
	stm32446_tim1_ccmr2.ic4f = STM32446Tim1_ic4f;
	stm32446_tim1_ccmr2.oc4pe = STM32446Tim1_oc4pe;
	stm32446_tim1_ccmr2.oc4fe = STM32446Tim1_oc4fe;
	stm32446_tim1_ccmr2.ic4psc = STM32446Tim1_ic4psc;
	stm32446_tim1_ccmr2.cc4s = STM32446Tim1_cc4s;
	stm32446_tim1_ccmr2.oc3ce = STM32446Tim1_oc3ce;
	stm32446_tim1_ccmr2.oc3m = STM32446Tim1_oc3m;
	stm32446_tim1_ccmr2.ic3f = STM32446Tim1_ic3f;
	stm32446_tim1_ccmr2.oc3pe = STM32446Tim1_oc3pe;
	stm32446_tim1_ccmr2.oc3fe = STM32446Tim1_oc3fe;
	stm32446_tim1_ccmr2.ic3psc = STM32446Tim1_ic3psc;
	stm32446_tim1_ccmr2.cc3s = STM32446Tim1_cc3s;
	return stm32446_tim1_ccmr2;
}
STM32446TIM1_CCER stm32446_tim1_ccer_inic(void)
{
	STM32446TIM1_CCER stm32446_tim1_ccer;
	// CCER
	stm32446_tim1_ccer.cc4p = STM32446Tim1_cc4p;
	stm32446_tim1_ccer.cc4e = STM32446Tim1_cc4e;
	stm32446_tim1_ccer.cc3np = STM32446Tim1_cc3np;
	stm32446_tim1_ccer.cc3ne = STM32446Tim1_cc3ne;
	stm32446_tim1_ccer.cc3p = STM32446Tim1_cc3p;
	stm32446_tim1_ccer.cc3e = STM32446Tim1_cc3e;
	stm32446_tim1_ccer.cc2np = STM32446Tim1_cc2np;
	stm32446_tim1_ccer.cc2ne = STM32446Tim1_cc2ne;
	stm32446_tim1_ccer.cc2p = STM32446Tim1_cc2p;
	stm32446_tim1_ccer.cc2e = STM32446Tim1_cc2e;
	stm32446_tim1_ccer.cc1np = STM32446Tim1_cc1np;
	stm32446_tim1_ccer.cc1ne = STM32446Tim1_cc1ne;
	stm32446_tim1_ccer.cc1p = STM32446Tim1_cc1p;
	stm32446_tim1_ccer.cc1e = STM32446Tim1_cc1e;
	return stm32446_tim1_ccer;
}
STM32446TIM1_BDTR stm32446_tim1_bdtr_inic(void)
{
	STM32446TIM1_BDTR stm32446_tim1_bdtr;
	// CCER
	stm32446_tim1_bdtr.moe = STM32446Tim1_moe;
	stm32446_tim1_bdtr.aoe = STM32446Tim1_aoe;
	stm32446_tim1_bdtr.bkp = STM32446Tim1_bkp;
	stm32446_tim1_bdtr.bke = STM32446Tim1_bke;
	stm32446_tim1_bdtr.ossr = STM32446Tim1_ossr;
	stm32446_tim1_bdtr.ossi = STM32446Tim1_ossi;
	stm32446_tim1_bdtr.lock = STM32446Tim1_lock;
	stm32446_tim1_bdtr.dtg = STM32446Tim1_dtg;
	return stm32446_tim1_bdtr;
}
STM32446TIM1_DCR stm32446_tim1_dcr_inic(void)
{
	STM32446TIM1_DCR stm32446_tim1_dcr;
	// CCER
	stm32446_tim1_dcr.dbl = STM32446Tim1_dbl;
	stm32446_tim1_dcr.dba = STM32446Tim1_dba;
	return stm32446_tim1_dcr;
}
/*** TIM1 INIC Procedure & Function Definition ***/
STM32446TIM1obj tim1_inic(void)
{
	STM32446TIM1obj stm32446_tim1;
	stm32446_tim1.reg = TIM1;
	// CLOCK
	stm32446_tim1.clock = STM32446Tim1Clock;
	// NVIC
	stm32446_tim1.nvic = STM32446Tim1Nvic;
	/*** TIM1 Bit Mapping Link ***/
	stm32446_tim1.cr1 = stm32446_tim1_cr1_inic();
	stm32446_tim1.cr2 = stm32446_tim1_cr2_inic();
	stm32446_tim1.smcr = stm32446_tim1_smcr_inic();
	stm32446_tim1.dier = stm32446_tim1_dier_inic();
	stm32446_tim1.sr = stm32446_tim1_sr_inic();
	stm32446_tim1.egr = stm32446_tim1_egr_inic();
	stm32446_tim1.ccmr1 = stm32446_tim1_ccmr1_inic();
	stm32446_tim1.ccmr2 = stm32446_tim1_ccmr2_inic();
	stm32446_tim1.ccer = stm32446_tim1_ccer_inic();
	stm32446_tim1.bdtr = stm32446_tim1_bdtr_inic();
	stm32446_tim1.dcr = stm32446_tim1_dcr_inic();
	stm32446_tim1.cnt = STM32446Tim1_cnt;
	stm32446_tim1.get_cnt = STM32446Tim1_get_cnt;
	stm32446_tim1.psc = STM32446Tim1_psc;
	stm32446_tim1.arr = STM32446Tim1_arr;
	stm32446_tim1.rep = STM32446Tim1_rcr;
	stm32446_tim1.ccr1 = STM32446Tim1_ccr1;
	stm32446_tim1.ccr2 = STM32446Tim1_ccr2;
	stm32446_tim1.ccr3 = STM32446Tim1_ccr3;
	stm32446_tim1.ccr4 = STM32446Tim1_ccr4;
	stm32446_tim1.dmar = STM32446Tim1_dmab;
	return stm32446_tim1;
}
/*** TIM8 Auxiliar ***/
STM32446TIM8_CR1 stm32446_tim8_cr1_inic(void)
{
	STM32446TIM8_CR1 stm32446_tim8_cr1;
	// CR1
	stm32446_tim8_cr1.get_ckd = STM32446Tim8_get_ckd;
	stm32446_tim8_cr1.apre = STM32446Tim8_set_apre;
	stm32446_tim8_cr1.cms = STM32446Tim8_set_cms;
	stm32446_tim8_cr1.dir = STM32446Tim8_set_dir;
	stm32446_tim8_cr1.opm = STM32446Tim8_set_opm;
	stm32446_tim8_cr1.urs = STM32446Tim8_set_urs;
	stm32446_tim8_cr1.udis = STM32446Tim8_set_udis;
	stm32446_tim8_cr1.cen = STM32446Tim8_cen;
	return stm32446_tim8_cr1;
}
STM32446TIM8_CR2 stm32446_tim8_cr2_inic(void)
{
	STM32446TIM8_CR2 stm32446_tim8_cr2;
	// CR2
	stm32446_tim8_cr2.ois4 = STM32446Tim8_ois4;
	stm32446_tim8_cr2.ois3n = STM32446Tim8_ois3n;
	stm32446_tim8_cr2.ois3 = STM32446Tim8_ois3;
	stm32446_tim8_cr2.ois2n = STM32446Tim8_ois2n;
	stm32446_tim8_cr2.ois1 = STM32446Tim8_ois1;
	stm32446_tim8_cr2.ti1s = STM32446Tim8_ti1s;
	stm32446_tim8_cr2.mms = STM32446Tim8_mms;
	stm32446_tim8_cr2.ccds = STM32446Tim8_ccds;
	stm32446_tim8_cr2.ccus = STM32446Tim8_ccus;
	stm32446_tim8_cr2.ccpc = STM32446Tim8_ccpc;
	return stm32446_tim8_cr2;
}
STM32446TIM8_SMCR stm32446_tim8_smcr_inic(void)
{
	STM32446TIM8_SMCR stm32446_tim8_smcr;
	// SMCR
	stm32446_tim8_smcr.etp = STM32446Tim8_etp;
	stm32446_tim8_smcr.ece = STM32446Tim8_ece;
	stm32446_tim8_smcr.etps = STM32446Tim8_etps;
	stm32446_tim8_smcr.etf = STM32446Tim8_etf;
	stm32446_tim8_smcr.msm = STM32446Tim8_msm;
	stm32446_tim8_smcr.ts = STM32446Tim8_ts;
	stm32446_tim8_smcr.sms = STM32446Tim8_sms;
	return stm32446_tim8_smcr;
}
STM32446TIM8_DIER stm32446_tim8_dier_inic(void)
{
	STM32446TIM8_DIER stm32446_tim8_dier;
	// DIER
	stm32446_tim8_dier.tde = STM32446Tim8_tde;
	stm32446_tim8_dier.cc4de = STM32446Tim8_cc4de;
	stm32446_tim8_dier.cc3de = STM32446Tim8_cc3de;
	stm32446_tim8_dier.cc2de = STM32446Tim8_cc2de;
	stm32446_tim8_dier.cc1de = STM32446Tim8_cc1de;
	stm32446_tim8_dier.ude = STM32446Tim8_ude;
	stm32446_tim8_dier.bie = STM32446Tim8_bie;
	stm32446_tim8_dier.tie = STM32446Tim8_tie;
	stm32446_tim8_dier.comie = STM32446Tim8_comie;
	stm32446_tim8_dier.cc4ie = STM32446Tim8_cc4ie;
	stm32446_tim8_dier.cc3ie = STM32446Tim8_cc3ie;
	stm32446_tim8_dier.cc2ie = STM32446Tim8_cc2ie;
	stm32446_tim8_dier.cc1ie = STM32446Tim8_cc1ie;
	stm32446_tim8_dier.uie = STM32446Tim8_uie;
	return stm32446_tim8_dier;
}
STM32446TIM8_SR stm32446_tim8_sr_inic(void)
{
	STM32446TIM8_SR stm32446_tim8_sr;
	// SR
	stm32446_tim8_sr.cc4of = STM32446Tim8_cc4of;
	stm32446_tim8_sr.clear_cc4of = STM32446Tim8_clear_cc4of;
	stm32446_tim8_sr.cc3of = STM32446Tim8_cc3of;
	stm32446_tim8_sr.clear_cc3of = STM32446Tim8_clear_cc3of;
	stm32446_tim8_sr.cc2of = STM32446Tim8_cc2of;
	stm32446_tim8_sr.clear_cc2of = STM32446Tim8_clear_cc2of;
	stm32446_tim8_sr.cc1of = STM32446Tim8_cc1of;
	stm32446_tim8_sr.clear_cc1of = STM32446Tim8_clear_cc1of;
	stm32446_tim8_sr.bif = STM32446Tim8_bif;
	stm32446_tim8_sr.clear_bif = STM32446Tim8_clear_bif;
	stm32446_tim8_sr.tif = STM32446Tim8_tif;
	stm32446_tim8_sr.clear_tif = STM32446Tim8_clear_tif;
	stm32446_tim8_sr.comif = STM32446Tim8_comif;
	stm32446_tim8_sr.clear_comif = STM32446Tim8_clear_comif;
	stm32446_tim8_sr.cc4if = STM32446Tim8_cc4if;
	stm32446_tim8_sr.clear_cc4if = STM32446Tim8_clear_cc4if;
	stm32446_tim8_sr.cc3if = STM32446Tim8_cc3if;
	stm32446_tim8_sr.clear_cc3if = STM32446Tim8_clear_cc3if;
	stm32446_tim8_sr.cc2if = STM32446Tim8_cc2if;
	stm32446_tim8_sr.clear_cc2if = STM32446Tim8_clear_cc2if;
	stm32446_tim8_sr.cc1if = STM32446Tim8_cc1if;
	stm32446_tim8_sr.clear_cc1if = STM32446Tim8_clear_cc1if;
	stm32446_tim8_sr.uif = STM32446Tim8_uif;
	stm32446_tim8_sr.clear_uif = STM32446Tim8_clear_uif;
	return stm32446_tim8_sr;
}
STM32446TIM8_EGR stm32446_tim8_egr_inic(void)
{
	STM32446TIM8_EGR stm32446_tim8_egr;
	// EGR
	stm32446_tim8_egr.bg = STM32446Tim8_bg;
	stm32446_tim8_egr.tg = STM32446Tim8_tg;
	stm32446_tim8_egr.cc4g = STM32446Tim8_cc4g;
	stm32446_tim8_egr.cc3g = STM32446Tim8_cc3g;
	stm32446_tim8_egr.cc2g = STM32446Tim8_cc2g;
	stm32446_tim8_egr.cc1g = STM32446Tim8_cc1g;
	stm32446_tim8_egr.ug = STM32446Tim8_ug;
	return stm32446_tim8_egr;
}
STM32446TIM8_CCMR1 stm32446_tim8_ccmr1_inic(void)
{
	STM32446TIM8_CCMR1 stm32446_tim8_ccmr1;
	// CCMR1
	stm32446_tim8_ccmr1.oc2ce = STM32446Tim8_oc2ce;
	stm32446_tim8_ccmr1.oc2m = STM32446Tim8_oc2m;
	stm32446_tim8_ccmr1.ic2f = STM32446Tim8_ic2f;
	stm32446_tim8_ccmr1.oc2pe = STM32446Tim8_oc2pe;
	stm32446_tim8_ccmr1.oc2fe = STM32446Tim8_oc2fe;
	stm32446_tim8_ccmr1.ic2psc = STM32446Tim8_ic2psc;
	stm32446_tim8_ccmr1.cc2s = STM32446Tim8_cc2s;
	stm32446_tim8_ccmr1.oc1ce = STM32446Tim8_oc1ce;
	stm32446_tim8_ccmr1.oc1m = STM32446Tim8_oc1m;
	stm32446_tim8_ccmr1.ic1f = STM32446Tim8_ic1f;
	stm32446_tim8_ccmr1.oc1pe = STM32446Tim8_oc1pe;
	stm32446_tim8_ccmr1.oc1fe = STM32446Tim8_oc1fe;
	stm32446_tim8_ccmr1.ic1psc = STM32446Tim8_ic1psc;
	stm32446_tim8_ccmr1.cc1s = STM32446Tim8_cc1s;
	return stm32446_tim8_ccmr1;
}
STM32446TIM8_CCMR2 stm32446_tim8_ccmr2_inic(void)
{
	STM32446TIM8_CCMR2 stm32446_tim8_ccmr2;
	// CCMR2
	stm32446_tim8_ccmr2.oc4ce = STM32446Tim8_oc4ce;
	stm32446_tim8_ccmr2.oc4m = STM32446Tim8_oc4m;
	stm32446_tim8_ccmr2.ic4f = STM32446Tim8_ic4f;
	stm32446_tim8_ccmr2.oc4pe = STM32446Tim8_oc4pe;
	stm32446_tim8_ccmr2.oc4fe = STM32446Tim8_oc4fe;
	stm32446_tim8_ccmr2.ic4psc = STM32446Tim8_ic4psc;
	stm32446_tim8_ccmr2.cc4s = STM32446Tim8_cc4s;
	stm32446_tim8_ccmr2.oc3ce = STM32446Tim8_oc3ce;
	stm32446_tim8_ccmr2.oc3m = STM32446Tim8_oc3m;
	stm32446_tim8_ccmr2.ic3f = STM32446Tim8_ic3f;
	stm32446_tim8_ccmr2.oc3pe = STM32446Tim8_oc3pe;
	stm32446_tim8_ccmr2.oc3fe = STM32446Tim8_oc3fe;
	stm32446_tim8_ccmr2.ic3psc = STM32446Tim8_ic3psc;
	stm32446_tim8_ccmr2.cc3s = STM32446Tim8_cc3s;
	return stm32446_tim8_ccmr2;
}
STM32446TIM8_CCER stm32446_tim8_ccer_inic(void)
{
	STM32446TIM8_CCER stm32446_tim8_ccer;
	// CCER
	stm32446_tim8_ccer.cc4p = STM32446Tim8_cc4p;
	stm32446_tim8_ccer.cc4e = STM32446Tim8_cc4e;
	stm32446_tim8_ccer.cc3np = STM32446Tim8_cc3np;
	stm32446_tim8_ccer.cc3ne = STM32446Tim8_cc3ne;
	stm32446_tim8_ccer.cc3p = STM32446Tim8_cc3p;
	stm32446_tim8_ccer.cc3e = STM32446Tim8_cc3e;
	stm32446_tim8_ccer.cc2np = STM32446Tim8_cc2np;
	stm32446_tim8_ccer.cc2ne = STM32446Tim8_cc2ne;
	stm32446_tim8_ccer.cc2p = STM32446Tim8_cc2p;
	stm32446_tim8_ccer.cc2e = STM32446Tim8_cc2e;
	stm32446_tim8_ccer.cc1np = STM32446Tim8_cc1np;
	stm32446_tim8_ccer.cc1ne = STM32446Tim8_cc1ne;
	stm32446_tim8_ccer.cc1p = STM32446Tim8_cc1p;
	stm32446_tim8_ccer.cc1e = STM32446Tim8_cc1e;
	return stm32446_tim8_ccer;
}
STM32446TIM8_BDTR stm32446_tim8_bdtr_inic(void)
{
	STM32446TIM8_BDTR stm32446_tim8_bdtr;
	// CCER
	stm32446_tim8_bdtr.moe = STM32446Tim8_moe;
	stm32446_tim8_bdtr.aoe = STM32446Tim8_aoe;
	stm32446_tim8_bdtr.bkp = STM32446Tim8_bkp;
	stm32446_tim8_bdtr.bke = STM32446Tim8_bke;
	stm32446_tim8_bdtr.ossr = STM32446Tim8_ossr;
	stm32446_tim8_bdtr.ossi = STM32446Tim8_ossi;
	stm32446_tim8_bdtr.lock = STM32446Tim8_lock;
	stm32446_tim8_bdtr.dtg = STM32446Tim8_dtg;
	return stm32446_tim8_bdtr;
}
STM32446TIM8_DCR stm32446_tim8_dcr_inic(void)
{
	STM32446TIM8_DCR stm32446_tim8_dcr;
	// CCER
	stm32446_tim8_dcr.dbl = STM32446Tim8_dbl;
	stm32446_tim8_dcr.dba = STM32446Tim8_dba;
	return stm32446_tim8_dcr;
}
/*** TIM8 INIC Procedure & Function Definition ***/
STM32446TIM8obj tim8_inic(void)
{
	STM32446TIM8obj stm32446_tim8;
	stm32446_tim8.reg = TIM8;
	// CLOCK
	stm32446_tim8.clock = STM32446Tim8Clock;
	// NVIC
	stm32446_tim8.nvic = STM32446Tim8Nvic;
	/*** TIM8 Bit Mapping Link ***/
	stm32446_tim8.cr1 = stm32446_tim8_cr1_inic();
	stm32446_tim8.cr2 = stm32446_tim8_cr2_inic();
	stm32446_tim8.smcr = stm32446_tim8_smcr_inic();
	stm32446_tim8.dier = stm32446_tim8_dier_inic();
	stm32446_tim8.sr = stm32446_tim8_sr_inic();
	stm32446_tim8.egr = stm32446_tim8_egr_inic();
	stm32446_tim8.ccmr1 = stm32446_tim8_ccmr1_inic();
	stm32446_tim8.ccmr2 = stm32446_tim8_ccmr2_inic();
	stm32446_tim8.ccer = stm32446_tim8_ccer_inic();
	stm32446_tim8.bdtr = stm32446_tim8_bdtr_inic();
	stm32446_tim8.dcr = stm32446_tim8_dcr_inic();
	stm32446_tim8.cnt = STM32446Tim8_cnt;
	stm32446_tim8.get_cnt = STM32446Tim8_get_cnt;
	stm32446_tim8.psc = STM32446Tim8_psc;
	stm32446_tim8.arr = STM32446Tim8_arr;
	stm32446_tim8.rep = STM32446Tim8_rcr;
	stm32446_tim8.ccr1 = STM32446Tim8_ccr1;
	stm32446_tim8.ccr2 = STM32446Tim8_ccr2;
	stm32446_tim8.ccr3 = STM32446Tim8_ccr3;
	stm32446_tim8.ccr4 = STM32446Tim8_ccr4;
	stm32446_tim8.dmar = STM32446Tim8_dmab;
	return stm32446_tim8;
}

/*** EOF ***/

/******
1º Sequence
2º Scope
	- Library Scope
	- File Scope
	- Function Scope
	- Precedence Scope
3º Pointer and Variable
4º Casting
******/


